### Extract Transform Load - The Movies Dataset

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import json

### import csv into DataFrame

In [6]:
movies_file = "Resources/movies_metadata_limited.csv"
movies_df = pd.read_csv(movies_file)
movies_df.head(2)

#genre_df = pd.DataFrame(({"movieid": premise_df['id'], 
                          #"genre": premise_df['genres']}))
#genre_df.head()

,budget,genres,id,imdb_id,original_language,original_title,overview,production_companies,release_date,revenue,runtime,vote_average,vote_count
0,30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...","[{'name': 'Pixar Animation Studios', 'id': 3}]",10/30/1995,373554033.0,81.0,7.7,5415.0
1,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,"[{'name': 'TriStar Pictures', 'id': 559}, {'na...",12/15/1995,262797249.0,104.0,6.9,2413.0

In [ ]:
# genre_file = "movie_genre.csv"
# genre_df = pd.read_csv(genre_file)
# genre_df.head()

In [3]:
len(genre_df)

21564

In [4]:
genre_df['genre'] = genre_df['genre'].str.replace(r"[\']", r'"')

In [5]:
genre_df.head()

   movieid                                              genre
0   131232  [{"id": 18, "name": "Drama"}, {"id": 10769, "n...
1    79782  [{"id": 18, "name": "Drama"}, {"id": 10749, "n...
2   141210  [{"id": 35, "name": "Comedy"}, {"id": 27, "nam...
3   143750                      [{"id": 18, "name": "Drama"}]
4    84198                [{"id": 99, "name": "Documentary"}]

### Convert Data Dictionary into DataFrame

In [6]:
def get_ids(json_string):
    id_list = []
    for obj in json.loads(json_string):
        id_list.append(obj['id'])
    return id_list

In [7]:
def get_names(json_string):
    name_list = []
    for obj in json.loads(json_string):
        name_list.append(obj['name'])
    return name_list

In [8]:
genre_id_list=genre_df['genre'].map(get_ids)

In [9]:

genre_name_list=genre_df['genre'].map(get_names)

In [12]:
movie_id_list = genre_df['movieid']

In [13]:
movie_genre_final_list=[]
import numpy as np
for i in np.arange(len(movie_id_list)):
    for j in np.arange(len(genre_name_list[i])):
        #for k in np.arange(len(genre_name_list[j])):
            movie_genre_final_list.append({"movie_id":movie_id_list[i],
                                             "genre_id":genre_id_list[i][j],
                                             "genre_name":genre_name_list[i][j]})

In [14]:
genre_final_df=pd.DataFrame(movie_genre_final_list)

In [15]:
genre_final_df

       movie_id  genre_id genre_name
0        131232        18      Drama
1        131232     10769    Foreign
2         79782        18      Drama
3         79782     10749    Romance
4        141210        35     Comedy
...         ...       ...        ...
42998       285        14    Fantasy
42999       285        28     Action
43000      1865        12  Adventure
43001      1865        28     Action
43002      1865        14    Fantasy

[43003 rows x 3 columns]

In [16]:
genre_main_df = pd.DataFrame({"genre_id": genre_final_df['genre_id'].unique(), 
                           "genre_name": genre_final_df['genre_name'].unique()})

In [17]:
genre_main_df.set_index("genre_id",inplace=True)

In [18]:
genre_main_df

               genre_name
genre_id
18                  Drama
10769             Foreign
10749             Romance
35                 Comedy
27                 Horror
99            Documentary
28                 Action
53               Thriller
80                  Crime
10751              Family
10402               Music
9648              Mystery
16              Animation
878       Science Fiction
37                Western
12              Adventure
14                Fantasy
36                History
10752                 War
10770            TV Movie

In [19]:
#movie_genre_link_df = pd.DataFrame(({"movie_id": genre_final_df['movie_id'], 
#                           "genre_id": genre_final_df['genre_id']}))

In [20]:
movie_genre_link_df

       movie_id  genre_id
0        131232        18
1        131232     10769
2         79782        18
3         79782     10749
4        141210        35
...         ...       ...
42998       285        14
42999       285        28
43000      1865        12
43001      1865        28
43002      1865        14

[43003 rows x 2 columns]

In [21]:
len(movie_genre_link_df)

43003